from pydantic import SecretStr
from pydantic_settings import BaseSettings, SettingsConfigDict

STUDENTS_NAMES = {
    2061148502: "Барбаччи Анастасия",
    "SOSchlenoSOS": "Батин Платон",  # закрыт
    1515192079: "Борисов Александр",
    855323286: "Быков Денис",
    "MaxMerzyl": "Голубенко Максим",  # закрыт
    5278809823: "Горбунова Ксения",
    1000131290: "Дерибин Матвей",
    1057129270: "Дзикевич Максим",
    592699018: "Ермохин Андрей",
    810636482: "Занин Никита",
    1033407535: "Иванов Никита",
    874865029: "Казанцев Арсений",
    748197936: "Канев Александр",
    378790166: "Колесников Алексей",
    "nhyseq": "Королёв Олег",  # мб вообще нет сообщений
    2117990099: "Кузнецов Александр",
    1493231220: "Курохтин Михаил",
    958255880: "Лихачёв Алексей",
    5216880345: "Лучшев Вадим",
    1028517848: "Лясин Иван",
    "Prapor02": "Магомедов Пайзула",  # закрыт
    754601226: "Макаров Вячеслав",
    760709790: "Олейник Данил",
    430354302: "Пшеничнов Святослав",
    861064904: "Ребриков Артём",
    691608678: "Рыбаченок Вадим",
    7148607418: "Сафронов Денис",
    "VovseNeTorch": "Селиверстов Дмитрий",  # нет сообщений мб
    5461434577: "Сон Владимир",
    1365932181: "Трубников Ярослав",
    6443296662: "Ушакова Ника",
    1002963862: "Штриков Дмитрий",
}
ANSWER_OPTIONS = ["На паре", "Опаздываю", "Отсутствую"]
ANSWER_OPTIONS_FOR_PRINT = ["на паре", "опаздывает", "отсутствует"]
TARGET_CHAT = -1002183941184
THREAD_ID = 2140
AWAIT_ANSWER_TIME = 30  # в пределах от 1 до 600 секунд
ADMINS_IDS = [760709790, 378790166, 5278809823]


class Settings(BaseSettings):
    bot_token: SecretStr

    model_config = SettingsConfigDict(env_file=".env", env_file_encoding="utf-8")


secret_enum = Settings()
